cf/Catalogs/EDUsageAgreements.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>EDUsageAgreements</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ServerAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PackageFormatVersion</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDPackageFormatVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyContract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalInformationProcessor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AdditionalReportsAndDataProcessors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompanyID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeEDPackageFormat</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CryptographyIsUsed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomingDocumentsDir</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomingDocumentsDirFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutgoingDocumentsDir</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutgoingDocumentsDirFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Banks</v8:Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ErrorDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VerifySignatureCertificates</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankApplication</Name>
					<Type>
						<v8:Type>cfg:EnumRef.BankApplications</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDFProfileSettings</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDFProfileSettings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgreementSetupExtendedMode</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomingDocumentsResource</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.EmailAccounts</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutgoingDocumentsResource</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyCertificateForEncryption</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompanyCertificateForDetails</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DigitalSignaturesAndEncryptionKeyCertificates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgreementState</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDAgreementStates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDExchangeMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDExchangeMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ConnectionStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDExchangeMemberStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgreementStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDAgreementsStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InvitationText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteRequiredSignaturesNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteSubscribersLogin</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeletePartner</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeletePassiveFTPConnection</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteFTPPort</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteValidityPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteTypicalAgreement</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDUsageAgreements</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteIsTypical</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EncryptEDPackageData</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailForInvitation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsIntercompany</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>OutgoingDocuments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>OutgoingDocument</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UseDS</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExpectDeliveryTicket</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ToForm</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FormatVersion</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EDFProfileSettings</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.EDFProfileSettings</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CounterpartyID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CompanyID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EDExchangeMethod</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDExchangeMethods</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CounterpartySignaturesCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Imprint</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Certificate</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CounterpartyCertificatePresentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CompanySignatureCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>NumberContainer</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Certificate</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DigitalSignaturesAndEncryptionKeyCertificates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>IncomingDocuments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IncomingDocument</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UseDS</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExpectDeliveryTicket</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ToForm</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ExchangeFilesFormats</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Use</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FileFormat</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDExchangeFileFormats</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/EDUsageAgreements/Forms/ListForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - FORM EVENT HANDLERS

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Not ElectronicDocumentsServiceCallServer.GetFunctionalOptionValue("UseEDExchange") Then
		MessageText = ElectronicDocumentsServiceCallServer.MessageTextAboutSystemSettingRequirement("WorkWithED");
		CommonUseClientServer.MessageToUser(MessageText, , , , Cancel);
		Return;
	EndIf;
	
	If Parameters.Property("WindowOpeningMode") Then
		ThisForm.WindowOpeningMode = Parameters.WindowOpeningMode;
	EndIf;
	
	If Parameters.Property("DoNotShowQuickFilters") Then
		Items.GroupQuickFilters.Visible = False;
	EndIf;
	
	CatalogsNameBanks = ElectronicDocumentsReUse.GetAppliedCatalogName("Banks");
	If ValueIsFilled(CatalogsNameBanks) Then
		AgreementsWithBanksList.QueryText = StrReplace(AgreementsWithBanksList.QueryText,
			"Agreement.Counterparty", "CAST(Agreement.Counterparty AS Catalog." + CatalogsNameBanks + ")");
	EndIf;
	
	Counterparty         = Parameters.Counterparty;
	EDFProfileSettings = Parameters.EDFProfileSettings;
	Company        = Parameters.Company;
	
	If ValueIsFilled(Counterparty) Then
		CommonUseClientServer.SetFilterItem(AgreementsWithCounterpartiesList.Filter, "Counterparty",
			Counterparty, DataCompositionComparisonType.Equal);
			
		ThisForm.AutoTitle = False;
		ThisForm.Title = NStr("en='EDF with counterparties settings';ru='Настройки ЭДО с контрагентами'");
		Items.AgreementsGroup.PagesRepresentation = FormPagesRepresentation.None;
		Items.AgreementsGroup.CurrentPage = Items.SettingsGroup;
	EndIf;
	
	If ValueIsFilled(EDFProfileSettings) Then
		CommonUseClientServer.SetFilterItem(AgreementsWithCounterpartiesList.Filter, "EDFProfileSettings",
			EDFProfileSettings, DataCompositionComparisonType.Equal);
			
		ThisForm.AutoTitle = False;
		ThisForm.Title = NStr("en='EDF with counterparties settings';ru='Настройки ЭДО с контрагентами'");
		Items.AgreementsGroup.PagesRepresentation = FormPagesRepresentation.None;
		Items.AgreementsGroup.CurrentPage = Items.SettingsGroup;
	EndIf;
	
	If ElectronicDocumentsReUse.UseAdditionalAnalyticsOfCompaniesCatalogPartners() Then
		
		AgreementsWithCounterpartiesList.QueryText = StrReplace(
			AgreementsWithCounterpartiesList.QueryText, """Partner""", "Agreement.Counterparty.Partner");
		If ValueIsFilled(Parameters.Partner) Then
			CommonUseClientServer.SetFilterItem(AgreementsWithCounterpartiesList.Filter, "Partner",
				Parameters.Partner, DataCompositionComparisonType.InHierarchy);
				
			ThisForm.AutoTitle = False;
			ThisForm.Title = NStr("en='Settings EDF with counterparties';ru='Настройки ЭДО с контрагентами'");
			Items.AgreementsGroup.PagesRepresentation = FormPagesRepresentation.None;
			Items.AgreementsGroup.CurrentPage = Items.SettingsGroup;
		EndIf;
	Else
		AgreementsWithCounterpartiesList.QueryText = StrReplace(
			AgreementsWithCounterpartiesList.QueryText, """Partner"" AS Partner,", "");
	EndIf;
	
	If ValueIsFilled(Counterparty)
		OR ValueIsFilled(EDFProfileSettings)
		OR ValueIsFilled(Parameters.Partner)
		OR Parameters.SettingsEDFWithCounterparties Then
		
		ThisForm.AutoTitle = False;
		ThisForm.Title = NStr("en='EDF with counterparties settings';ru='Настройки ЭДО с контрагентами'");
		Items.AgreementsGroup.PagesRepresentation = FormPagesRepresentation.None;
		Items.AgreementsGroup.CurrentPage    = Items.SettingsGroup;
	EndIf;
	
	If ValueIsFilled(Parameters.Bank) Then
		CommonUseClientServer.SetFilterItem(AgreementsWithBanksList.Filter, "Bank",
			Parameters.Bank, DataCompositionComparisonType.Equal);
			
		ThisForm.AutoTitle = False;
		ThisForm.Title = NStr("en='EDF settings with banks';ru='Настройки ЭДО с банками'");
		Items.AgreementsGroup.PagesRepresentation = FormPagesRepresentation.None;
		Items.AgreementsGroup.CurrentPage = Items.GroupAgreementsWithBanksList;
	EndIf;
	
	If ValueIsFilled(Company) Then
		CommonUseClientServer.SetFilterItem(
			AgreementsWithBanksList.Filter, "Company", Company, DataCompositionComparisonType.Equal);
		CommonUseClientServer.SetFilterItem(
			AgreementsWithCounterpartiesList.Filter, "Company", Company, DataCompositionComparisonType.Equal);
		CommonUseClientServer.SetFilterItem(
			ListAgreementsBetweenCompanies.Filter, "Company", Company, DataCompositionComparisonType.Equal);
	EndIf;
	
	// Hide group "All agreements" from users with limited rights or forced.
	HideAllAgreementsBookmark = Not Users.InfobaseUserWithFullAccess()
									OR ValueIsFilled(Parameters.Counterparty)
									OR ValueIsFilled(Parameters.Company)
									OR ValueIsFilled(Parameters.Bank)
									OR ValueIsFilled(Parameters.EDFProfileSettings)
									OR ValueIsFilled(Parameters.Partner)
									OR Parameters.SettingsEDFWithCounterparties;
	
	Items.GroupAllAgreements.Visible = Not HideAllAgreementsBookmark;
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	ElectronicDocumentsServiceClient.FillDataServiceSupport(ServiceSupportPhoneNumber, ServiceSupportEmailAddress);
	
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	If EventName = "RefreshStateED" Then
		Items.AgreementsWithCounterpartiesList.Refresh();
	EndIf;
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// FORM COMMAND HANDLERS

&AtClient
Procedure LoadSettings(Command)
	
	AddressInStorage = Undefined;
	Handler = New NotifyDescription("SettingFileChoiceProcessing", ThisObject);
	BeginPutFile(Handler, AddressInStorage, "*.xml", True, UUID);

EndProcedure

&AtClient
Procedure OpenLinkTo1CBuhphoneItem(Command)
	
	ElectronicDocumentsServiceClient.OpenStatement1CBuhphone();
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - FORM FIELD EVENT HANDLERS

&AtClient
Procedure CounterpartyOnChange(Item)
	SetFilterOnCounterparty(ThisObject, Counterparty);
EndProcedure

&AtClient
Procedure CompanyOnChange(Item)
	SetFilterByCompany(ThisObject, Company);
EndProcedure

&AtClient
Procedure StatusOnChange(Item)
	SetFilterByConnectionStatus(ThisObject, ConnectionStatus);
EndProcedure

&AtClient
Procedure AgreementStateOnChange(Item)
	SetFilterByAgreementState(ThisObject, AgreementState);
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - TABLE FIELD EVENT HANDLERS SettingListWithCounterparties

&AtClient
Procedure CreateListItemSettingsWithContractors(Command)
	
	FormParameters = New Structure;
	FillingValues = New Structure;
	FillingValues.Insert("Company",        Company);
	FillingValues.Insert("EDFProfileSettings", EDFProfileSettings);
	FillingValues.Insert("Counterparty",         Counterparty);
	
	FormParameters.Insert("FillingValues", FillingValues);
	OpenForm("Catalog.EDUsageAgreements.Form.ItemForm", FormParameters);
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - TABLE FIELD EVENT HANDLERS ListIntercompany

&AtClient
Procedure IntercompanyListBeforeAddRow(Item, Cancel, Copy, Parent, Group)
	
	Cancel = True;
	Parameter = ?(Copy, New Structure("CopyingValue", Items.ListIntercompany.CurrentRow),
		New Structure);
	
	OpenForm("Catalog.EDUsageAgreements.Form.IntercompanyItemForm", Parameter,
		Items.ListIntercompany);
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - TABLE FIELD EVENT HANDLERS AgreementsWithBanksList

&AtClient
Procedure AgreementsWithBanksListBeforeAddRow(Item, Cancel, Copy, Parent, Group)
	
	Cancel = True;
	Parameter = ?(Copy, New Structure("CopyingValue", Items.AgreementsWithBanksList.CurrentRow), New Structure);
	Parameter.Insert("Company", Company);
	Parameter.Insert("Counterparty", Parameters.Bank);
	OpenForm(
		"Catalog.EDUsageAgreements.Form.ItemFormBank", Parameter, Items.AgreementsWithBanksList);
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// GENERAL PURPOSE PROCEDURES AND FUNCTIONS

&AtClientAtServerNoContext
Procedure SetFilterOnCounterparty(Form, FilterValue)
	
	UseFilter = ValueIsFilled(FilterValue);
	
	CommonUseClientServer.SetFilterItem(
										Form.AgreementsWithCounterpartiesList.Filter,
										"Counterparty",
										FilterValue,
										DataCompositionComparisonType.Equal,
										,
										UseFilter);
EndProcedure

&AtClientAtServerNoContext
Procedure SetFilterByCompany(Form, FilterValue)
	
	UseFilter = ValueIsFilled(FilterValue);
	
	CommonUseClientServer.SetFilterItem(
										Form.AgreementsWithCounterpartiesList.Filter,
										"Company",
										FilterValue,
										DataCompositionComparisonType.Equal,
										,
										UseFilter);
EndProcedure

&AtClientAtServerNoContext
Procedure SetFilterByConnectionStatus(Form, FilterValue)
	
	UseFilter = ValueIsFilled(FilterValue);
	
	CommonUseClientServer.SetFilterItem(
										Form.AgreementsWithCounterpartiesList.Filter,
										"ConnectionStatus",
										FilterValue,
										DataCompositionComparisonType.Equal,
										,
										UseFilter);
EndProcedure

&AtClientAtServerNoContext
Procedure SetFilterByAgreementState(Form, FilterValue)
	
	UseFilter = ValueIsFilled(FilterValue);
	
	CommonUseClientServer.SetFilterItem(
										Form.AgreementsWithCounterpartiesList.Filter,
										"AgreementState",
										FilterValue,
										DataCompositionComparisonType.Equal,
										,
										UseFilter);
EndProcedure

&AtClient
Procedure SettingFileChoiceProcessing(Result, Address, FileName, AdditionalParameters) Export
	
	If Result = True Then
		FormParameters = New Structure("CompletingSettings", Address);
		OpenForm("Catalog.EDUsageAgreements.Form.ItemFormBank", FormParameters);
	EndIf;
	
EndProcedure
